# Pandas Basics

Much like numpy can be used to query and analyze data, pandas can do the same thing!  The reason that both tools are used in the data science community is that they fill different requirements and excel at different things.  In this lecture we will be learning more about pandas and it's strengths, specifically:

* Pandas versus Numpy
* Pandas indexes
* Working with data in Pandas
* SQL Introduction
* Querying DataFrames
* Merging DataFrames
* Stacking and Unstacking
* Aggregations

## Pandas versus Numpy

In the last lecture we learned about Numpy and it's power for making Python very fast.  We saw how to query data, as well as learned how Numpy "thinks" about data, as a tensor.  In this lecture we will look at Pandas, which thinks about data primarily like a database table.  This is because there are obvious primitives for dealing with one dimensional tensors, called `Series` and obvious primitives for dealing with two dimensional tensors called a `DataFrame`, but there are no obvious primitives for dealing with "higher order" tensors in pandas.  You can do some things for creating higher order tensors in pandas, but honestly it's kind of tough to work with that set of primitives.

While pandas is limited in the order of dimensions it can represent, most data is either one dimensional or two dimensional anyway, or at the very least can be decomposed to an order 1 or order 2 tensor, so this isn't as much of a restriction as you might think.  In this way you can think of pandas as "specializing" in the typical case and not worrying about the exotic cases.

Additionally, generally speaking pandas is somewhat slower than numpy.  For this reason it is possible to access numpy equivalents of any of the pandas data structures, allowing you to access numpy's speed, while making use of pandas ease of use, in some cases.  That said, not all pandas operations can be done with the numpy objects.

Let's look at some simple examples of how to do things in numpy and equivalently in pandas:

In [5]:
import numpy as np
import time

start = time.time()
vector_one = np.array([1, 4, 7])
vector_two = np.array([2, 4, 6])

print("Result", np.matmul(vector_one, vector_two.T))
print("took ", time.time() - start, "seconds")

Result 60
took  0.00042819976806640625 seconds

In [6]:
import pandas as pd

start = time.time()
series_one = pd.Series(vector_one)
series_two = pd.Series(vector_two)

print("Result", series_one.dot(series_two.T))
print("took", time.time() - start, "seconds")

Result 60
took 0.0012764930725097656 seconds

As you can see the numpy version is an entire order of magnitude faster.  But the pandas version is a little bit easier to read.

Next let's look at how to slice pandas versus numpy data structures:

In [10]:
array = np.random.normal(0, 1, size=10000)

start = time.time()
print("Result", len(array[array > 0.5])/len(array))
print("took", time.time() - start, "seconds")

Result 0.3196
took 0.0003104209899902344 seconds

In [11]:
series = pd.Series(array)

start= time.time()
print("Result", len(series[series > 0.5])/len(array))
print("took", time.time() - start, "seconds")

Result 0.3196
took 0.0016829967498779297 seconds

So as you can see, numpy flatly beats pandas for speed.  However, there are two ways in which pandas is the better choice.  First, look at the number of public methods associated with a pandas Series versus a numpy order 1 tensor:

In [12]:
numpy_methods = [method for method in dir(array) if "_" not in method]
pandas_methods = [method for method in dir(series) if "_" not in method]
print(len(numpy_methods))
print(len(pandas_methods))

71
158

It should be clear, that you can just do _a lot_ more with a pandas series out of the box than a numpy order 1 tensor.  While this isn't always a good thing, it's worth keeping in mind the strengths and deficiencies of both frameworks.

## Pandas Indexes

Pandas dataframe come equipped with three indexes:
* an index for columns
* an index for rows
* an ordering for rows that serves as in implicit index.

The third index is the least forward without an example, and we'll look at it soon.

Let's look at a motivating example for the rows and columns first:

In [14]:
import pandas as pd

supply_matrix = np.random.rand(3,3) * 100
demand_vector = np.random.rand(3) * 100

df = pd.DataFrame(supply_matrix)
df.columns = ["Manufacturing", "Technology", "Real Estate"]
df

   Manufacturing  Technology  Real Estate
0      15.733845   54.994273    26.636739
1      39.737975   14.633238    27.060675
2      99.489180   84.865771    62.413707

As you can see the columns are listed above the dataframe's data and give us information how each column is semantically named.  If you've ever seen an excel spreadsheet, a database table or a CSV, this is carries the same meaning.

Additionally there is a row index as shown on the left hand side of the dataframe.  This can either be a simple enumeration of the columns, indexed by the natural numbers, or it can take on a semantic meaning as follows:

In [20]:
import pandas as pd

supply_matrix = np.random.rand(3,3) * 100

df = pd.DataFrame(supply_matrix)
df.columns = ["Manufacturing", "Technology", "Real Estate"]
df.index = ["Manufacturing", "Technology", "Real Estate"]
df

               Manufacturing  Technology  Real Estate
Manufacturing      28.319233    3.615384    71.878214
Technology         15.882315   33.206169    91.800734
Real Estate        23.779109   94.587522    65.557476

But typically it is the former rather than the latter which is used for the row index.  Let's return to our previous example and show the "third" index:

In [22]:
import pandas as pd

supply_matrix = np.random.rand(3,3) * 100

df = pd.DataFrame(supply_matrix)
df.columns = ["Manufacturing", "Technology", "Real Estate"]
df

   Manufacturing  Technology  Real Estate
0      88.838630   49.091207     0.960337
1      78.447857   47.530946    33.912809
2      57.043741   67.166951    32.933661

In [23]:
df = df.sort_values("Manufacturing")
df

   Manufacturing  Technology  Real Estate
2      57.043741   67.166951    32.933661
1      78.447857   47.530946    33.912809
0      88.838630   49.091207     0.960337

As you can see, now the row index is inconflict with order in which the rows appear.  This means we can query for the first row in two ways:

In [24]:
df.iloc[0]

Manufacturing    57.043741
Technology       67.166951
Real Estate      32.933661
Name: 2, dtype: float64

In [25]:
df.loc[2]

Manufacturing    57.043741
Technology       67.166951
Real Estate      32.933661
Name: 2, dtype: float64

Notice these two ways of selecting the first row in the dataframe differed in which index they use, but return the same information.  This will become especially important when we move onto merging dataframes, because the row index is used rather than the "implicit" third index, defined by the order the data appears in the dataframe.  This explicit row index _can_ be mutated of course, but need not be when a mutation to the ordering of data occurs.  This may seem complex, but can be desirable, especially given the ability to control when and if this explicit row index is updated.

## Working With Data In Pandas

One of pandas greatest strengths is it's ability to easily read in data and dump out data.  Let's look at an example:

In [36]:
supply_matrix = np.round(np.random.rand(500,3) * 100, 2)

df1 = pd.DataFrame(supply_matrix)
df1.columns = ["Manufacturing", "Technology", "Real Estate"]
df1.to_csv("economy.csv", index=False)

Here we choose not to save our index to the csv which is why `index=False`, this tells the method to not save the index as well, just the data.  Now let's see how to read in the dataframe:

In [37]:
df2 = pd.read_csv("economy.csv")
df2.equals(df1)

True

We can also read csv's directly from the internet with the same method:

In [39]:
churn_df = pd.read_csv("https://raw.githubusercontent.com/EricSchles/datascience_book/master/Churn_Modelling.csv")
churn_df

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

As you can see, all we need to do is supply a url pointing to a csv and we are all set!  In addition to being able to save to csvs and read from csvs, we can also read data directly from a database into pandas!  This is why pandas is sometimes thought of as an "in-memory" database.

For this we are going to need a connection object to the database and a relevant query:

In [1]:
!heroku config:get DATABASE_URL -a limitless-brook-05892

 ›   Warning: heroku update available from 7.42.4 to 7.42.8.
postgres://iplxzpexpwitbu:de934ccb02766f0175be3114e97a687ac3ca6192f817faf5a7af5bf379200bb4@ec2-52-204-232-46.compute-1.amazonaws.com:5432/dd18i1ap02mb2p

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
engine = create_engine('postgres://iplxzpexpwitbu:de934ccb02766f0175be3114e97a687ac3ca6192f817faf5a7af5bf379200bb4@ec2-52-204-232-46.compute-1.amazonaws.com:5432/dd18i1ap02mb2p')
sql_table_df = pd.read_sql("select * from public.table", engine)

In [3]:
sql_table_df.head()

   id  manufacturing  technology  real_estate
0   1          33.02       62.58        14.47
1   2          67.90       85.50        21.02
2   3          21.38       15.68        19.35
3   4          64.38       35.94        31.53
4   5          83.37       12.78        48.09

As you can see, we can pull in any information we might want from a database connect, directly into python.  This is a huge asset for doing data analysis and can make working on real world projects much easier.  Notice that we have all the column names automatically as they appear in the database without any further manipulation in python.  This makes the pandas dataframe, truly a batteries included library.  

## SQL Introduction

Since reading data from a database is so important for working as a data scientist, we'll do a brief review of SQL now and then look at the pandas equivalences along side our SQL queries.

The most basic SQL query is:

`SELECT * FROM [SCHEMA NAME].[TABLE NAME];`

Notice that this statement, like all SQL statements ends with a `;` which is necessary unlike in python.  We've already seen an example, but let's look at it again:

In [4]:
sql_data = engine.execute("SELECT * FROM public.table;").fetchall()

Notice that we need to call the `fetchall` method in order to actually execute the query.  Whenever we are getting data from a database connection object, we need to do a fetch of some kind.  There are multiple fetch methods available:

In [12]:
[
    method 
    for method in dir(engine.execute("SELECT * FROM public.table;")) 
    if "fetch" in method and "_" not in method
]

['fetchall', 'fetchmany', 'fetchone']

We will make use of `fetchall` most often, however for large tables that can't be read in all at once `fetchmany` and `fetchone` are useful primitives.

Now let's look at the pandas equivalence:

In [13]:
#id	manufacturing	technology	real_estate
sql_table_df[["id", "manufacturing", "technology", "real_estate"]]

       id  manufacturing  technology  real_estate
0       1          33.02       62.58        14.47
1       2          67.90       85.50        21.02
2       3          21.38       15.68        19.35
3       4          64.38       35.94        31.53
4       5          83.37       12.78        48.09
..    ...            ...         ...          ...
995   996          92.38       69.01        93.16
996   997          75.25        6.93        66.94
997   998          95.81        1.46        29.54
998   999          10.90       60.03        55.69
999  1000          48.88       90.51        31.89

[1000 rows x 4 columns]

As you can see, we have to be explicit about which columns we want in this version of the select statement.  However we can choose specific columns to select in both SQL and in pandas:

In [14]:
sql_data = engine.execute("SELECT manufacturing FROM public.table;").fetchall()

In [15]:
sql_table_df["manufacturing"]

0      33.02
1      67.90
2      21.38
3      64.38
4      83.37
       ...
995    92.38
996    75.25
997    95.81
998    10.90
999    48.88
Name: manufacturing, Length: 1000, dtype: float64

In general SQL statements function sort of like list comprehensions.  And most of them are built around the basic `SELECT` statement we just looked at.  Now let's explore some modifiers to this `SELECT` statement.  First let's look at how to recover information about the data from our query.

These sorts of statements will take specific columns, apply functions to those columns, and then return the resultant transformation.  Here are some examples:

engine.execute("SELECT COUNT(manufacturing) FROM public.table;").fetchall()

Here we want to know how many rows the manufacturing column has from the `public.table`.  In general database tables all have the same number of rows, however we'll see how other modifers break this rule.  In addition to being able to call `COUNT` on a single column, we can also call it across all columns:

In [17]:
engine.execute("SELECT COUNT(*) FROM public.table;").fetchall()

[(1000,)]

Here are the pandas equivalences:

In [18]:
len(sql_table_df["manufacturing"]), sql_table_df["manufacturing"].shape[0]

(1000, 1000)

The above are two different wants to return the number of rows for a specific column.  We can also do this across all rows:

In [19]:
len(sql_table_df), sql_table_df.shape[0]

(1000, 1000)

Next let's look at how to get the maximum or minimum of a column in SQL:

In [20]:
engine.execute("SELECT MAX(manufacturing), MIN(manufacturing) FROM public.table;").fetchall()

[(99.94, 0.17)]

As you can see, we can return multiple transformations on a single column in one `SELECT` statement.  This makes SQL very flexible, however this can also make things complicated quickly.  We'll see how to resolve that in a moment.  But first let's look at the pandas equivalence:

In [21]:
sql_table_df["manufacturing"].max(), sql_table_df["manufacturing"].min()

(99.94, 0.17)

One difference between SQL and pandas is with pandas we can operate over the entire dataframe at once:

In [23]:
sql_table_df.max()

id               1000.00
manufacturing      99.94
technology         99.98
real_estate        99.94
dtype: float64

In [24]:
sql_table_df.min()

id               1.00
manufacturing    0.17
technology       0.02
real_estate      0.02
dtype: float64

The equivalent is not as easily accomplished in SQL.  Next let's see how to query for rows that meet specific conditions.  For this we will need a `WHERE` clause as follows:


`SELECT * FROM [SCHEMA NAME].[TABLE NAME] WHERE [TABLE COLUMN MEETS CONDITION];`

Let's look at some specific examples:

In [25]:
sql_data = engine.execute("SELECT * FROM public.table WHERE manufacturing>0.3;").fetchall()

The pandas equivalence is:

In [26]:
sql_table_df[
    sql_table_df["manufacturing"] > 0.3
]

       id  manufacturing  technology  real_estate
0       1          33.02       62.58        14.47
1       2          67.90       85.50        21.02
2       3          21.38       15.68        19.35
3       4          64.38       35.94        31.53
4       5          83.37       12.78        48.09
..    ...            ...         ...          ...
995   996          92.38       69.01        93.16
996   997          75.25        6.93        66.94
997   998          95.81        1.46        29.54
998   999          10.90       60.03        55.69
999  1000          48.88       90.51        31.89

[996 rows x 4 columns]

We can modify both of these statements to ensure that the number of rows is the same for both:

In [27]:
engine.execute("SELECT COUNT(*) FROM public.table WHERE manufacturing>0.3;").fetchall()

[(996,)]

In [28]:
sql_table_df[sql_table_df["manufacturing"] > 0.3].shape[0]

996

As you can see the same number of elements is returned in both cases.  Next let's look at an equality condition:

In [29]:
engine.execute("SELECT * FROM public.table WHERE id=10;").fetchall()

[(10, 32.98, 2.65, 64.05)]

And the pandas equivalence:

In [30]:
sql_table_df[sql_table_df["id"] == 10]

   id  manufacturing  technology  real_estate
9  10          32.98        2.65        64.05

Notice the use of double equals in pandas and single equals in SQL as a difference between the two statements.  Sometimes our SQL statements can get very verbose, for this reason sometimes its useful to name our selections, especially if they are being modified.  In order to do this we use the `AS` keyword as follows:

```
SELECT
[SELECTED COLUMN OR TRANSFORMATION] as transform
FROM [SCHEMA NAME].[TABLE NAME];
```

Let's look at an example:

In [32]:
engine.execute("""
SELECT 
    MIN(manufacturing) as min_manufacturing,
    MAX(technology) as max_technology,
    COUNT(real_estate) as size 
FROM 
    public.table 
WHERE 
    real_estate >0.5;
""").fetchall()

[(0.17, 99.98, 997)]

There isn't really a pandas equivalence to this naming convention, but it's necessary, when multiple `SELECT` statements are combined:

In [35]:
engine.execute("""
SELECT 
    MIN(manufacturing)
FROM (
 SELECT * 
 FROM public.table 
 WHERE real_estate>0.5
) as expensive_real_estate;
""").fetchall()

[(0.17,)]

The multiple select statement query does have an equivalence in pandas:

In [36]:
expensive_real_estate = sql_table_df[sql_table_df["real_estate"] > 0.5]
expensive_real_estate["manufacturing"].min()

0.17

One final point to make, and an important difference between SQL statements and querying a pandas dataframe:

### Order is not guaranteed in a SQL `SELECT` statement.

This point may seem trivial but it will come up at some point on a project so I mention it here.  You can always impose an ordering with an `ORDER BY` statement which will see in a moment.  But if you fail to impose an ordering, it is not guaranteed that your rows will be returned in the same order.  Let's see an example now:

In [40]:
sql_data_one = engine.execute("""
 SELECT * 
 FROM public.table 
 ORDER BY manufacturing;
""").fetchall()

sql_data_two = engine.execute("""
 SELECT * 
 FROM public.table;
""").fetchall()

sql_data_one == sql_data_two

False

While we cannot guarantee ordering in SQL, we can in pandas.  That said, we can choose to change how the data is order with a call to `sort_values`:

In [41]:
sql_table_df = sql_table_df.sort_values("manufacturing")
sql_table_df

      id  manufacturing  technology  real_estate
138  139           0.17       36.97        44.12
678  679           0.19       35.07        65.14
496  497           0.24       29.61        90.06
985  986           0.26       14.91        87.16
926  927           0.54       64.66        84.81
..   ...            ...         ...          ...
378  379          99.53       41.98        22.99
734  735          99.65       53.13        68.78
743  744          99.88       61.07        76.66
552  553          99.93       29.96        29.13
384  385          99.94       35.17        27.71

[1000 rows x 4 columns]

Notice if we do not mutate the dataframe by reassigning it, the new ordering will not be maintained.  This is why we have an equals statement followed by the `sort_values` method.

Because this is a course on python and not SQL this ends our demonstration of SQL statements and there pandas equivalences.  The point is hopefully clear - pandas can do most if not all of the same things as a SQL query.